---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BuildingPad.HostId
source: html/de889336-b51c-0fdb-a939-5ae74f01c3e9.htm
---
# Autodesk.Revit.DB.Architecture.BuildingPad.HostId Property

The element id of the topography surface hosting this BuidlingPad.

## Syntax (C#)
```csharp
public ElementId HostId { get; }
```